dj-zhou/one-third-hal-stm32/one-third-hal/core/general-utils.c
        RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK | RCC_CLOCKTYPE_SYSCLK
                                      | RCC_CLOCKTYPE_PCLK1
                                      | RCC_CLOCKTYPE_PCLK2;
        RCC_ClkInitStruct.SYSCLKSource   = RCC_SYSCLKSOURCE_PLLCLK;
        RCC_ClkInitStruct.AHBCLKDivider  = RCC_SYSCLK_DIV1;
        RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV4;
        RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV2;

        if ( HAL_RCC_ClockConfig( &RCC_ClkInitStruct, FLASH_LATENCY_7 )
             != HAL_OK ) {
            Error_Handler( HSE_VALUE * 5 );
        }
        PeriphClkInitStruct.PeriphClockSelection = RCC_PERIPHCLK_USART3;
        PeriphClkInitStruct.Usart3ClockSelection = RCC_USART3CLKSOURCE_PCLK1;
        if ( HAL_RCCEx_PeriphCLKConfig( &PeriphClkInitStruct ) != HAL_OK ) {
            Error_Handler( HSE_VALUE * 5 );
        }
    }
    else {
        // #error not supported.
    }
    VerifyClocks( 216000000, 54000000, 108000000 );
    return HAL_OK;
}
#endif

// ============================================================================
static HAL_StatusTypeDef InitSystemClock( void ) {
#if defined( STM32F030x8 )
    return InitClock_F030x8();
#elif defined( STM32F103xB )
    return InitClock_F103xB();
#elif defined( STM32F107xC )
    return InitClock_F107xC();
#elif defined( STM32F407xx )
    return InitClock_F407xx();
#elif defined( STM32F427xx )
    return InitClock_F427xx();
#elif defined( STM32F767xx )
    return InitClock_F767xx();
#else
#error InitSystemClock(): TO IMPLEMENT
#endif
    // it will call HAL_MspInit() in stm32f1xx_hal_msp.c
    // thte HAL_MspInit() initialized the SysTick to 1K Hz frequency
    // however, our stime.config() will override it.
    HAL_Init();
    return HAL_OK;
}

// ============================================================================
static void InitNvicInterrupt( uint8_t group ) {
#if defined( STM32F030x8 )
    // seems no grouping for Cortex M0
    ( void )group;
    return;
#else
    switch ( group ) {
    case 0:
        HAL_NVIC_SetPriorityGrouping( NVIC_PRIORITYGROUP_0 );
        break;
    case 1:
        HAL_NVIC_SetPriorityGrouping( NVIC_PRIORITYGROUP_1 );
        break;
    case 2:
        HAL_NVIC_SetPriorityGrouping( NVIC_PRIORITYGROUP_2 );
        break;
    case 3:
        HAL_NVIC_SetPriorityGrouping( NVIC_PRIORITYGROUP_3 );
        break;
    case 4:
    default:
        HAL_NVIC_SetPriorityGrouping( NVIC_PRIORITYGROUP_4 );
        break;
        // can not do anything, because this function is usually called
        // before console setup and led_he setup
        break;
    }
#endif
}

// ============================================================================
static void enableGpioClock( GPIO_TypeDef* GPIOx ) {
#if defined( GPIOA_EXISTS )
    if ( GPIOx == GPIOA ) {
        __HAL_RCC_GPIOA_CLK_ENABLE();
        return;
    }
#endif
#if defined( GPIOB_EXISTS )
    if ( GPIOx == GPIOB ) {
        __HAL_RCC_GPIOB_CLK_ENABLE();
        return;
    }
#endif
#if defined( GPIOC_EXISTS )
    if ( GPIOx == GPIOC ) {
        __HAL_RCC_GPIOC_CLK_ENABLE();
        return;
    }
#endif
#if defined( GPIOD_EXISTS )
    if ( GPIOx == GPIOD ) {
        __HAL_RCC_GPIOD_CLK_ENABLE();
        return;
    }
#endif
#if defined( GPIOE_EXISTS )
    if ( GPIOx == GPIOE ) {
        __HAL_RCC_GPIOE_CLK_ENABLE();
        return;
    }
#endif
#if defined( GPIOF_EXISTS )
    if ( GPIOx == GPIOF ) {
        __HAL_RCC_GPIOF_CLK_ENABLE();
        return;
    }
#endif
#if defined( GPIOG_EXISTS )
    if ( GPIOx == GPIOG ) {
        __HAL_RCC_GPIOG_CLK_ENABLE();
        return;
    }
#endif
#if defined( GPIOH_EXISTS )
    if ( GPIOx == GPIOH ) {
        __HAL_RCC_GPIOH_CLK_ENABLE();
        return;
    }
#endif
#if defined( GPIOI_EXISTS )
    if ( GPIOx == GPIOI ) {
        __HAL_RCC_GPIOI_CLK_ENABLE();
        return;
    }
#endif
#if defined( GPIOJ_EXISTS )
    if ( GPIOx == GPIOJ ) {
        __HAL_RCC_GPIOJ_CLK_ENABLE();
        return;
    }
#endif
#if defined( GPIOK_EXISTS )
    if ( GPIOx == GPIOK ) {
        __HAL_RCC_GPIOK_CLK_ENABLE();
        return;
    }
#endif
    ( void )GPIOx;
}

// ============================================================================
static void enableTimerClock( TIM_TypeDef* TIMx ) {
#if defined( TIM1_EXISTS )
    if ( TIMx == TIM1 ) {
        __HAL_RCC_TIM1_CLK_ENABLE();
        return;
    }
#endif
#if defined( TIM2_EXISTS )
    if ( TIMx == TIM2 ) {
        __HAL_RCC_TIM2_CLK_ENABLE();
        return;
    }
#endif
#if defined( TIM3_EXISTS )
    if ( TIMx == TIM3 ) {
        __HAL_RCC_TIM3_CLK_ENABLE();
        return;
    }
#endif
#if defined( TIM4_EXISTS )
    if ( TIMx == TIM4 ) {
        __HAL_RCC_TIM4_CLK_ENABLE();
        return;
    }
#endif
#if defined( TIM5_EXISTS )
    if ( TIMx == TIM5 ) {
        __HAL_RCC_TIM5_CLK_ENABLE();
        return;
    }
#endif
#if defined( TIM6_EXISTS )
    if ( TIMx == TIM6 ) {
        __HAL_RCC_TIM6_CLK_ENABLE();
        return;
    }
#endif
#if defined( TIM7_EXISTS )
    if ( TIMx == TIM7 ) {
        __HAL_RCC_TIM7_CLK_ENABLE();
        return;
    }
#endif
#if defined( TIM8_EXISTS )
    if ( TIMx == TIM8 ) {
        __HAL_RCC_TIM8_CLK_ENABLE();
        return;
    }
#endif
#if defined( TIM9_EXISTS )
    if ( TIMx == TIM9 ) {
        __HAL_RCC_TIM9_CLK_ENABLE();
        return;
    }
#endif
#if defined( TIM10_EXISTS )
    if ( TIMx == TIM10 ) {
        __HAL_RCC_TIM10_CLK_ENABLE();
        return;
    }
#endif
#if defined( TIM11_EXISTS )
    if ( TIMx == TIM11 ) {
        __HAL_RCC_TIM11_CLK_ENABLE();
        return;
    }
#endif
#if defined( TIM12_EXISTS )
    if ( TIMx == TIM12 ) {
        __HAL_RCC_TIM12_CLK_ENABLE();
        return;
    }
#endif
#if defined( TIM13_EXISTS )
    if ( TIMx == TIM13 ) {
        __HAL_RCC_TIM13_CLK_ENABLE();
        return;
    }
#endif
#if defined( TIM14_EXISTS )
    if ( TIMx == TIM14 ) {
        __HAL_RCC_TIM14_CLK_ENABLE();
        return;
    }
#endif
#if defined( TIM15_EXISTS )
    if ( TIMx == TIM15 ) {
        __HAL_RCC_TIM15_CLK_ENABLE();
        return;
    }
#endif
#if defined( TIM16_EXISTS )
    if ( TIMx == TIM16 ) {
        __HAL_RCC_TIM16_CLK_ENABLE();
        return;
    }
#endif
#if defined( TIM17_EXISTS )
    if ( TIMx == TIM17 ) {
        __HAL_RCC_TIM17_CLK_ENABLE();
        return;
    }
#endif
    ( void )TIMx;
}

// ============================================================================
// to be extended
static void enableUartClock( USART_TypeDef* USARTx ) {
#if defined( USART1_EXISTS )
    if ( USARTx == USART1 ) {
        __HAL_RCC_USART1_CLK_ENABLE();
        return;
    }
#endif
#if defined( USART2_EXISTS )
    if ( USARTx == USART2 ) {
        __HAL_RCC_USART2_CLK_ENABLE();
        return;
    }
#endif
#if defined( USART3_EXISTS )
    if ( USARTx == USART3 ) {
        __HAL_RCC_USART3_CLK_ENABLE();
        return;
    }
#endif
#if defined( UART4_EXISTS )
    if ( USARTx == UART4 ) {
        __HAL_RCC_UART4_CLK_ENABLE();
        return;
    }
#endif
#if defined( UART5_EXISTS )
    if ( USARTx == UART5 ) {
        __HAL_RCC_UART5_CLK_ENABLE();
        return;
    }
#endif
#if defined( USART6_EXISTS )
    if ( USARTx == USART6 ) {
        __HAL_RCC_USART6_CLK_ENABLE();
        return;
    }
#endif
#if defined( UART7_EXISTS )
    if ( USARTx == UART7 ) {
        __HAL_RCC_UART7_CLK_ENABLE();
        return;
    }
#endif
#if defined( UART8_EXISTS )
    if ( USARTx == UART8 ) {
        __HAL_RCC_UART8_CLK_ENABLE();
        return;
    }
#endif
    ( void )USARTx;
}

// ============================================================================
// good for GPIO_MODE_INPUT (not GPIO_Mode_IPU??), GPIO_MODE_OUTPUT_PP
static void setPinMode( GPIO_TypeDef* GPIOx, uint8_t pin_n, uint32_t io ) {
    assert_param( IS_GPIO_MODE( io ) );
    uint16_t GPIO_PIN_x = 1 << pin_n;

// #if defined( STM32F107xC )  // || ( defined STM32F10Xxxxx)
// PB3/PB4 and PA15 is used as JTDO/TRACESWO after reset,
// therefore we must first disable JTAG and async trace functions to
// release PB3/PB4 for GPIO use this operation is confirmed on STM32F1
// micro controllers

