dj-zhou/one-third-hal-stm32/one-third-hal/core/general-utils.c
// these need to be tested ------------------
#if !defined( STM32F030x8 ) && !defined( STM32F767xx ) \
    && !defined( STM32F407xx ) && !defined( STM32F427xx )
    if ( ( ( GPIOx == GPIOB )
           && ( ( GPIO_PIN_x & GPIO_PIN_3 ) || ( GPIO_PIN_x & GPIO_PIN_4 ) ) )
         || ( ( GPIOx == GPIOA ) && ( GPIO_PIN_x == GPIO_PIN_15 ) ) ) {
        __HAL_RCC_AFIO_CLK_ENABLE();
        DBGMCU->CR &= ~( DBGMCU_CR_TRACE_IOEN );
        __HAL_AFIO_REMAP_SWJ_NONJTRST();
    }
#endif

    enableGpioClock( GPIOx );

    GPIO_InitTypeDef GPIO_InitStructure;
    GPIO_InitStructure.Pin   = GPIO_PIN_x;
    GPIO_InitStructure.Speed = GPIO_SPEED_FREQ_HIGH;
    GPIO_InitStructure.Mode  = io;
    HAL_GPIO_Init( GPIOx, &GPIO_InitStructure );
}

// ============================================================================
static void setPinPull( GPIO_TypeDef* GPIOx, uint8_t pin_n, uint32_t p ) {
    assert_param( IS_GPIO_PULL( p ) );

    enableGpioClock( GPIOx );

    GPIO_InitTypeDef GPIO_InitStructure;
    GPIO_InitStructure.Pin   = 1 << pin_n;
    GPIO_InitStructure.Speed = GPIO_SPEED_FREQ_HIGH;
    GPIO_InitStructure.Mode  = p;
    HAL_GPIO_Init( GPIOx, &GPIO_InitStructure );
}

// ============================================================================
static void setPin( GPIO_TypeDef* GPIOx, uint8_t pin_n, bool v ) {
    uint16_t GPIO_Pin_x = 1 << pin_n;
    if ( v ) {
        HAL_GPIO_WritePin( GPIOx, GPIO_Pin_x, GPIO_PIN_SET );
    }
    else {
        HAL_GPIO_WritePin( GPIOx, GPIO_Pin_x, GPIO_PIN_RESET );
    }
}

// ============================================================================
static void togglePin( GPIO_TypeDef* GPIOx, uint8_t pin_n ) {
    GPIOx->ODR ^= 1 << pin_n;
}

// ============================================================================
#if defined( RTOS_IS_USED )
// ----------------------------------------------------------------------------
static void setRtosState( RtosState_e state ) {
    rtos_state_ = state;
}

// ----------------------------------------------------------------------------
static RtosState_e getRtosState( void ) {
    return rtos_state_;
}

#endif  // RTOS_IS_USED

// ============================================================================
// clang-format off
CoreUtilsApi_t utils = {
    .system.initClock  = InitSystemClock   ,
    .system.initNvic   = InitNvicInterrupt ,
    .clock.enableGpio  = enableGpioClock   ,
    .clock.enableTimer = enableTimerClock  ,
    .clock.enableUart  = enableUartClock   ,
    .pin.mode          = setPinMode        ,
    .pin.pull          = setPinPull        ,
    .pin.set           = setPin            ,
    .pin.toggle        = togglePin         ,
#if defined( RTOS_IS_USED )
    .rtos.setState     = setRtosState      ,
    .rtos.getState     = getRtosState      ,
#endif
};
// clang-format on
